app/Controllers/Bidcontroller.php

    public function edit_bid($id)
    {
        $db = new BidModel();
        $data = [];
        $record  = $db->where('id', $id)->first();
---
SELECT *
FROM `bids`
WHERE `id` = '1'
 LIMIT 1