app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `bids`
WHERE `deadline` <= '2023-12-03'
SELECT COUNT(*) AS `numrows`
FROM `bids`
---
    public function index(): string
    {
        $data['title'] = 'dashboard';


        // get db handle
        $job_db = new JobModel();
        $bid_db = new BidModel();
        $log_db = new LoginModel();
        // create quaries that aggregate data summary
        $data['total_expire_bids'] = $bid_db->where('deadline <=', date('Y-m-d'))->countAllResults();
        $data['total_bids'] = $bid_db->countAllResults();