app/Models/BidModel.php

    public function getBids()
    {
        return $this->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `bids`
ORDER BY `id` DESC

    public function unexpireBids()
    {
        return $this->orderBy('id', 'desc')->where('deadline >=', date('Y-m-d'))->findAll();
---
SELECT *
FROM `bids`
WHERE `deadline` >= '2023-12-03'
ORDER BY `id` DESC

    public function updateBid($id, $data)
    {
        return $this->where('id', $id)->set($data)->update();
---
UPDATE `bids` SET `bidTitle` = 'A bid for the construction of a 3mv hydro Electricity Power Plan', `lastEditedBy` = 'testuse@gmail.com'
WHERE `id` = '1'